GeneratedFiles/BasicHttpBinding_USCOREIImageryService.GetMapUri.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns4="http://dev.virtualearth.net/webservices/v1/common"
 xmlns:ns5="http://schemas.microsoft.com/2003/10/Serialization/"
 xmlns:ns7="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
 xmlns:ns1="http://s.mappoint.net/mappoint-30/"
 xmlns:ns10="http://dev.virtualearth.net/webservices/v1/geocode"
 xmlns:ns9="http://dev.virtualearth.net/webservices/v1/geocode/contracts"
 xmlns:ns13="http://dev.virtualearth.net/webservices/v1/imagery"
 xmlns:ns12="http://dev.virtualearth.net/webservices/v1/imagery/contracts"
 xmlns:ns16="http://dev.virtualearth.net/webservices/v1/route"
 xmlns:ns15="http://dev.virtualearth.net/webservices/v1/route/contracts"
 xmlns:ns6="http://dev.virtualearth.net/webservices/v1/search"
 xmlns:ns3="http://dev.virtualearth.net/webservices/v1/search/contracts">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns12:GetMapUri>
    <ns12:request>
     <ns13:Center>
      <ns4:Altitude>0.0</ns4:Altitude>
      <ns4:Latitude>0.0</ns4:Latitude>
      <ns4:Longitude>0.0</ns4:Longitude>
     </ns13:Center>
     <ns13:MajorRoutesDestination>
      <ns4:Altitude>0.0</ns4:Altitude>
      <ns4:Latitude>0.0</ns4:Latitude>
      <ns4:Longitude>0.0</ns4:Longitude>
     </ns13:MajorRoutesDestination>
     <ns13:Options>
      <ns13:DisplayLayers>
       <ns7:string></ns7:string>
      </ns13:DisplayLayers>
      <ns13:ImageSize>
       <ns4:Height>0</ns4:Height>
       <ns4:Width>0</ns4:Width>
      </ns13:ImageSize>
      <ns13:ImageType>Default</ns13:ImageType>
      <ns13:PreventIconCollision>false</ns13:PreventIconCollision>
      <ns13:Style>Road</ns13:Style>
      <ns13:UriScheme>Http</ns13:UriScheme>
      <ns13:ZoomLevel>0</ns13:ZoomLevel>
     </ns13:Options>
     <ns13:Pushpins>
      <ns4:Pushpin>
       <ns4:IconStyle></ns4:IconStyle>
       <ns4:Label></ns4:Label>
       <ns4:Location>
        <ns4:Altitude>0.0</ns4:Altitude>
        <ns4:Latitude>0.0</ns4:Latitude>
        <ns4:Longitude>0.0</ns4:Longitude>
       </ns4:Location>
      </ns4:Pushpin>
     </ns13:Pushpins>
    </ns12:request>
   </ns12:GetMapUri>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
